In [7]:
import numpy as np

In [1]:
import pandas as pd

In [2]:
s= pd.Series(25,index=['1','2','3'])
s

1    25
2    25
3    25
dtype: int64

In [3]:
d= pd.Series({'a':9, 'b':8, 'c':10})
d

a     9
b     8
c    10
dtype: int64

In [4]:
d1= pd.Series({'a':9, 'b':8, 'c':10}, index=['c','a','b','d'])
d1

c    10.0
a     9.0
b     8.0
d     NaN
dtype: float64

In [5]:
q=pd.Series([1,2,3],['c','d','e'])
q1=pd.Series([9,8,7,6],['a','b','c','d'])
q+q1

a    NaN
b    NaN
c    8.0
d    8.0
e    NaN
dtype: float64

In [8]:
z= pd.DataFrame(np.arange(10).reshape(2,5))
z

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [9]:
z1= {'one': pd.Series([1,2,3],index=['a','b','c']),
     'two': pd.Series([9,8,7,6],index=['a','b','c','d'])}
z2= pd.DataFrame(z1)
z2

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [10]:
pd.DataFrame(z1, index=['b','c','d'], columns=['two','three'])

   two three
b    8   NaN
c    7   NaN
d    6   NaN

In [11]:
z3= {'one': [1,2,3,4], 'two':[9,8,7,6]}
z4= pd.DataFrame(z3, index=['a','b','c','d'])
z4

   one  two
a    1    9
b    2    8
c    3    7
d    4    6

In [12]:
w= pd.DataFrame(np.arange(12).reshape(3,4))
w

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [13]:
w1= pd.DataFrame(np.arange(20).reshape(4,5))
w1

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [14]:
w+w1

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [15]:
w*w1

      0     1      2      3   4
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN